{
    "intents": [{ "tag": "greeting", "patterns": ["Hi there", "How are you", "Is anyone there?", "Hey", "Hola", "Hello", "Good day"], "responses": ["Hello, thanks for asking", "Good to see you again", "Hi there, how can I help?"], "context": [""] }, { "tag": "goodbye", "patterns": ["Bye", "See you later!", "Goodbye!", "Nice chatting to you, bye", "Till next time", "see you soon", "Later !", "See you!"], "responses": ["See you!", "Have a nice day", "Bye! Come back again soon."], "context": [""] }, { "tag": "thanks", "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"], "responses": ["Happy to help!", "Any time!", "My pleasure"], "context": [""] }, { "tag": "options", "patterns": ["How you could help me?", "What help you provide?", "How you can be helpful?"], "responses": ["I can guide you through cervical cancer diagnosis", "I can provide support related only to cervical cancer"], "context": [""] }, { "tag": "invalid", "patterns": ["Marry me", "I love You", "date me", "chat with me", "I am bored"], "responses": ["Please ask organisation related query."], "context": [""] }, { "tag": "noans", "patterns": ["why", "how", "when", "I", "you", "where", "what"], "responses": ["Can't Understand Your Question", "please elaborate your question", "Sorry, can't understand you", "Please give me more info", "Not sure I understand"], "context": [""] }, { "tag": "name", "patterns": ["what is your name?", "what should I call you?"], "responses": ["I'm Cervical Cancer Diagnosis Help", "Hey! I'm Cervical Cancer Diagnosis Help"], "context": [""] }, { "tag": "about", "patterns": ["how you doing?", "how are you"], "responses": ["I'm doing great!", "I'm doing good!", "Good! What about You?", "Great! Thanks For Asking! How can I help you?"], "context": [""] }, { "tag": "creator", "patterns": ["Who did create you?", "Who did make you?", "Who did create you?", "Who found you ?"], "responses": ["I was created by Pierjos COLERE", "Pierjos COLERE! Here is his website : pierjos-colere-website.web.app", "I was created by Pierjos COLERE! Here is his website : pierjos-colere-website.web.app"], "context": [""] }, { "tag": "definition", "patterns": ["What is cervical cancer?", "Can you define cervical cancer?", "Definition of cervical cancer ?"], "responses": ["Cervical cancer is the fourth most common cancer in women worldwide. It develops in the cervix, the lower portion of the uterus that connects the uterus to the vagina and starts when the cells that line the cervix begin to develop abnormal changes. he cells first become pre-cancerous and then cancerous, forming growths on the surface of the cervix. More than 12,000 new cases of invasive cervical cancer are diagnosed each year, the majority of which affect women between the ages of 35 to 44."], "context": [""] }, { "tag": "causes", "patterns": ["What causes cervical cancer?", "What can causes cervical cancer?", "Causes ?"], "responses": ["The vast majority of cervical cancers are caused by the human papillomavirus (HPV), a sexually transmitted group of more than 150 viruses. HPV infections are common and spread during vaginal, anal and oral sex. The U.S. Centers for Disease Control and Prevention (CDC) warns that HPV can be passed even when an infected person has no symptoms. A healthy person will typically fight off an HPV infection, but certain strains of the virus may cause genital warts and cancer. In addition to cervical cancer, HPV also causes vulvar, vaginal, penile, anal and oropharyngeal cancers, which include cancer of the throat, tongue and tonsils."], "context": [""] }, { "tag": "symptoms", "patterns": ["What are cervical cancer symptoms?", "What are cervical cancer signs?", "symptoms?", "signs?", "cervical cancer symptoms?", "How to know if I have a cervical cancer ?", "What are the symptoms?", "Do I have cervical cancer?"], "responses": ["Most women do not notice symptoms in the early stages of cervical cancer, which makes early diagnosis challenging. In later stages of cervical cancer, symptoms may include: Vaginal bleeding, Urinary tract infection (UTI), Pain in the pelvic area, Pain during sex. All of these cervical cancer symptoms should be discussed with a doctor.", "If you are experiencing symptoms, such as bleeding or spotting between periods, unusual or bloody discharge, pain during sex, bleeding during or after sex or bleeding after menopause, see your doctor right away. These signs may indicate less serious conditions, such as an infection, but they also may be signs of cervical cancer. Diagnosing cervical cancer in its early stages may increase your treatment options and improve your outcomes. Note that cervical cancer is one of the most successfully treatable cancers. All of these cervical cancer symptoms should be discussed with a doctor."], "context": [""] }, { "tag": "risks", "patterns": ["What are the risk factors for cervical cancer?", "risks?", "risk factors?", "What are the risk factors?"], "responses": ["Persistent HPV infection, typically over a period of 10 to 20 years, presents the greatest risk for developing cervical cancer. Smoking further increases your cervical cancer risk, as does having multiple sex partners and a history of cervical dysplasia (abnormal cell growth). Women who are chronically immunosuppressed due to taking certain medications, such as steroids, or having a transplant or HIV infection, are also at an increased risk."], "context": [""] }, { "tag": "advanced_symptoms", "patterns": ["What are advanced cervical cancer symptoms?", "advanced symptoms?", "advanced cervical cancer symptoms?"], "responses": ["Cervical cancer may spread (metastasize) within the pelvis, to the lymph nodes, or form tumors elsewhere in the body. Signs of advanced cervical cancer include: Leg pain or swelling, Weight loss, Fatigue, Back pain, Leakage of urine or feces from the vagina, Bone fractures, Difficulty urinating and having a bowel movement, Blood in the urine. All of these cervical cancer symptoms should be discussed with a doctor."], "context": [""] }, { "tag": "types", "patterns": ["What are cervical cancer types?", "types?", "cervical cancer types?"], "responses": ["There are two main types of cervical cancer : Squamous cell carcinoma accounts for about 90 percent of all cases, Adenocarcinoma of the cervix develops in gland cells. Cervical adenocarcinoma is somewhat rare, but it has become more common in recent decades. Some cervical tumors may involve both squamous cells and glandular cells."], "context": [""] }, { "tag": "treatment", "patterns": ["What is cervical cancer treatment?", "What are cervical cancer treatments?", "treatment?", "How to treat cervical cancer?", "How to treat it?"], "responses": ["Treatment options for cancer of the cervix include: Surgery, Chemotherapy, Radiation therapy, Targeted therapy, Immunotherapy. "], "context": [""] }, { "tag": "stages", "patterns": ["What are the stages of cervical cancer?", "Stage?", "Cervical Cancer Stages?", "How to know my stage"], "responses": ["There are four stages. Stage I: The cancer is limited to the cervix and has not grown any farther. This stage is further separated into subcategories. Stage II: The cancer has spread to the upper part of the vagina or the tissue surrounding the uterus, but it has not spread to lymph nodes or distant sites. Stage III: The cancer has reached the lower portion of the vagina and/or the muscles that surround the pelvic area (pelvic walls). The tumor may be large enough to cause kidney problems by blocking the tubes that transport urine from the kidneys to the bladder (the ureters). It may have reached nearby lymph nodes. Stage IV: The cancer has spread into the bladder, rectum, or beyond the pelvic area to distant parts of the body."], "context": [""] }, { "tag": "diagnosis", "patterns": ["What are the tools and tests used for diagnosing cervical cancer?", "How to diagnose ?", "Diagnosis?", "What are the diagnosis to do ?"], "responses": ["There are several diagnosis to do. Pap test - A Pap test is usually the first step in determining cervical health and is often performed as part of routine screening. Most women are advised to get a Pap test starting at age 21. Depending on your age and risk, your doctor may also suggest an additional test for infection of human papillomavirus (HPV), because prior infection with high-risk types of HPV has been linked to an increased risk of cervical cancer. Pelvic exam - A doctor manually examines the vagina, cervix, uterus, fallopian tubes, ovaries and rectum for things like nodules or bumps, which may be explored in greater detail with imaging technology. Colposcopy - A doctor uses a special microscope, called a colposcope, to examine the cervix. The colposcope is designed to provide an enlarged view of the areas, allowing your doctor to observe any abnormal tissue. If abnormal tissue is identified, the tissue is biopsied. Biopsies. Imaging tests. Lab tests. "], "context": [""] }, { "tag": "tools", "patterns": ["What are the tools and tests used for diagnosing cervical cancer?", "How to diagnose ?", "Diagnosis?", "What are the diagnosis to do ?"], "responses": ["There are several diagnosis to do. Pap test - A Pap test is usually the first step in determining cervical health and is often performed as part of routine screening. Most women are advised to get a Pap test starting at age 21. Depending on your age and risk, your doctor may also suggest an additional test for infection of human papillomavirus (HPV), because prior infection with high-risk types of HPV has been linked to an increased risk of cervical cancer. Pelvic exam - A doctor manually examines the vagina, cervix, uterus, fallopian tubes, ovaries and rectum for things like nodules or bumps, which may be explored in greater detail with imaging technology. Colposcopy - A doctor uses a special microscope, called a colposcope, to examine the cervix. The colposcope is designed to provide an enlarged view of the areas, allowing your doctor to observe any abnormal tissue. If abnormal tissue is identified, the tissue is biopsied. Biopsies. Imaging tests. Lab tests."], "context": [""] }, { "tag": "life_quality", "patterns": ["How can I preserve my quality of life during treatment?", "How to maintain the life quality ?", "Quality?"], "responses": ["Throughout treatment, it is important to communicate with your care team about how you are feeling and how your body is reacting to chemotherapy, targeted therapy or radiation therapy, and/or how it’s recovering from surgery. To help you prepare for treatment, it is important to know ahead of time what side effects you may experience, so you can be proactive in managing them."], "context": [""] }, { "tag": "surgery", "patterns": ["Will I need surgery?", "Is surgery important for cervical cancer?", "What about surgery?"], "responses": ["Surgery to remove the cancer is often part of the treatment regimen for women with cervical cancer. Surgery may be combined with chemotherapy and/or radiation or targeted therapy. Ask your doctor about the specific treatment options available to you."], "context": [""] }]
}